Repository: Digitaler-Bucherschrank/mobile_app
Catalog: lib/l10n/intl_*.arb
Languages: de

# dialog_ok_button
source: Alright
de: Alles klar

# error_connectivity_desc
source: Enable connectivity on your device to ensure full functionality of the app.
de: Verbinde dich wieder mit dem Internet, um alle Funktionen der App nutzen zu können.

# error_connectivity_title
source: Limited Functionality
de: Limitierte Funktionen

# error_invalid_mail
source: Email is invalid!
de: Email ist ungültig!

# error_invalid_username
source: Username contains invalid characters!
de: Nutzername besitzt ungültige Zeichen!

# error_login_failed
source: Login failed. Please try again
de: Einloggen fehlgeschlagen. Bitte versuch es erneut

# error_login_invalid_credentials
source: Username or Password invalid!
de: Nutzername oder Passwort ungültig!

# error_mail_taken
source: Email already used by another user!
de: Email wird bereits verwendet!

# error_maintenance_desc
source: Please restart the app and try later again.
de: Bitte starten Sie die App neu und versuchen es später noch einmal.

# error_maintenance_title
source: Server is currently in maintenance!
de: Der Server ist derzeit in Wartung!

# error_try_later
source: Error! Try again later.
de: Fehler! Versuchen Sie es später nochmal.

# error_username_taken
source: Username already taken!
de: Nutzername wird bereits verwendet!

# error_username_too_long
source: Username too long!
de: Nutzername zu lang!

# error_username_too_short
source: Username too short
de: Nutzername zu kurz!

# label_accept
source: Accept
de: Akzeptieren

# label_bookcase_now_digital
source: The open bookcases - now digital
de: Die offenen Bücherschränke - nun digital

# label_bookinfo
source: Book-Info
de: Buch-Infos

# label_borrowbook
source: Take Book
de: Buch nehmen

# label_close_sheet
source: Close
de: Schließen

# label_confirm_pw
source: Confirm password
de: Password bestätigen

# label_donate_book
source: Donate book
de: Buch spenden

# label_done
source: Done!
de: Fertig!

# label_dropbook
source: Return book
de: Buch ablegen

# label_empty_bookcase
source: Bookcase inventory is empty!
de: Inventar des Bücherschranks ist leer!

# label_empty_user
source: Your inventory is empty!
de: Ihr Inventar ist leer!

# label_functionality
source: Functionality
de: Funktionsweise

# label_functionality_text
source: You can find your city's open bookcases compact on one map in the App. You can take a look at the bookcases' Inventories and borrow, return and donate books.
de: In dieser App kannst du die verschiedenen offenen Bücherschränke deiner Stadt kompakt auf einer Karte finden. Du kannst die jeweiligen Inventare betrachten, Bücher ausleihen & Bücher spenden bzw. zurücklegen!

# label_help
source: Help
de: Hilfe

# label_inventory
source: Your Inventory
de: Dein Inventar

# label_isbn_test
source: Testing ISBN...
de: Prüfe ISBN...

# label_isbn_unvalid
source: ISBN is unvalid!
de: ISBN ist nicht valide!

# label_isbn_valid
source: ISBN is valid!
de: ISBN ist valide!

# label_loading
source: Loading...
de: Lade...

# label_login_button
source: Login
de: Anmelden

# label_logout
source: Logout
de: Ausloggen

# label_map
source: Map
de: Karte

# label_online_and_offline
source: Online as well as offline!
de: Sowohl online als auch offline!

# label_online_and_offline_text
source: The App can be used with and without an internet connection. Functions like taking a look at the bookcases' Inventories are only accessible in online mode, but functions like the map can always be used.
de: Die App kannst du sowohl offline als auch online nutzen. Funktionen wie das Betrachten der Inventare funktionieren nur im Online-Modus, allerdings funktionieren Funktionen wie die Karte auch ohne Internet.

# label_password
source: Password
de: Passwort

# label_read_data_protection
source: I have read and understood the privacy policy!
de: Ich habe die Datenschutzerklärung gelesen und verstanden!

# label_scanner_autor
source: Author
de: Autor

# label_scanner_bookcase
source: Bookcase:
de: Bücherschrank:

# label_scanner_bookinfo
source: Book information:
de: Buchinformationen:

# label_scanner_confirm
source: Confirm
de: Bestätigen

# label_scanner_description
source: Description
de: Beschreibung

# label_scanner_distance
source: Distance:
de: Entfernung:

# label_scanner_enterISBN
source: Scan barcode or enter ISBN!
de: Barcode scannen oder ISBN eingeben!

# label_scanner_fromInventory
source: Add book from inventory
de: Buch aus Inventar ablegen

# label_scanner_fromWhere
source: Where should the book be added from?
de: Von wo soll das Buch hinzugefügt werden?

# label_scanner_manual_explanation
source: Enter the key data of the book!
de: Eckdaten des Buchs eingeben!

# label_scanner_necessary
source: *Strictly necessary for processing.
de: *Zwingend notwendig zur Verarbeitung.

# label_scanner_newBook
source: Add new book
de: Neues Buch ablegen

# label_scanner_notYourBook
source: Not your Book? Scann the barcode again or enter the correct isbn.
de: Nicht Ihr Buch? Barcode erneut scannen bzw. korrekte ISBN eigeben.

# label_scanner_publishedDate
source: Date of publishment
de: Erscheinungsdatum

# label_scanner_publisher
source: Publisher
de: Verlag

# label_scanner_success
source: Success!
de: Fertig!

# label_scanner_title
source: Title
de: Titel

# label_search
source: Search
de: Suchen

# label_searchprocess
source: Searching...
de: Suchen...

# label_server_unavailable
source: Server not available right now. Please try later again
de: Server derzeit nicht erreichbar. Bitte versuche es später

# label_settings
source: Settings
de: Einstellungen

# label_settings_about
source: About
de: Über

# label_settings_general
source: General
de: Allgemein

# label_settings_language
source: Language
de: Sprache

# label_show_books
source: Show books
de: Bücher anzeigen

# label_signup_button
source: Registrieren
de: Signup

# label_username
source: Username
de: Nutzername

# label_view_books
source: Show books
de: Siehe Bücher

# label_we_depend_on_you
source: We depend on you!
de: Wir sind auf dich angewiesen!

# label_we_depend_on_you_text
source: The App depends on having many users to keep the information displayed as useful and reliable as possible. Therefore we ask you to spread the word! The more people use the App, the more it's useful for everyone.
de: Diese App lebt davon, dass so viele Bücherschränkler*innen wie möglich diese nutzen, damit die bei uns verfügbaren Informationen aktuell & nützlich sind. Daher bitten wir dich: Spread the Word! Je mehr diese App nutzen, desto mehr hat jeder davon.

# label_welcome
source: Welcome
de: Willkommen

# label_welcome_to
source: Welcome to the Digital Bookcase Project!
de: Willkommen zum Projekt Digitaler Bücherschrank!

# label_welcome_user
source: Welcome, {name}!
de: Willkommen, {name}!

# title
source: Digital Bookcase
de: Digitaler Bücherschrank
